soaunlam2021/soa-entorno-integracion/stm32_demos/stm32-maple/demos/uart_echo_int/main.c
#define USE_STDPERIPH_DRIVER
#include "stm32f10x.h"


volatile char in_char;
volatile char *out_str = "Got:_\n";
volatile int curr_char;

/* Handler predefined by STM32 library to handle USART1 interrupts. */
void USART1_IRQHandler(void)
{
    if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET) {
        GPIOC->ODR = GPIOC->ODR ^ 0x00001000;
        if(curr_char == -1) {
            in_char = USART_ReceiveData(USART1);

            USART_ITConfig(USART1, USART_IT_TXE, ENABLE);

            curr_char = 1;
            USART_SendData(USART1, out_str[0]);
        } else {
            /* Discard byte if we are still processing the last one. */
            USART_ReceiveData(USART1);
        }
    }

    if(USART_GetITStatus(USART1, USART_IT_TXE) != RESET) {
        GPIOC->ODR = GPIOC->ODR ^ 0x00001000;

        if(curr_char == -1) {
            USART_SendData(USART1, '!'); //This should never happen
        } else if(out_str[curr_char] == '_') {
            curr_char++;
            USART_SendData(USART1, in_char);
        } else if(out_str[curr_char] == '\0') {
            curr_char = -1;
            USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
        } else {
            USART_SendData(USART1, out_str[curr_char++]);
        }
    }
}




int main(void)
{
    init_led();

    init_button();

    init_rs232();
    enable_rs232_interrupts();
    curr_char = -1;
    enable_rs232();

    while(1);
}
